app/controllers/expenses_controller.rb

  def edit
    @expense = Expense.find(params[:id])
---
SELECT * FROM "expenses" WHERE ("expenses"."id" = 129)

  def cancel
    if Expense.exists? params[:id]
      @expense = Expense.find(params[:id])
---
SELECT "expenses".id FROM "expenses" WHERE ("expenses"."id" = '129') LIMIT 1