app/controllers/recurrent_expenses_controller.rb

SELECT * FROM "recurrent_expenses"
---
  def index
    @recurrent_expenses = RecurrentExpense.all

SELECT * FROM "recurrent_expenses" WHERE ("recurrent_expenses"."id" = 1)
---
  def edit
    @recurrent_expense = RecurrentExpense.find(params[:id])

SELECT * FROM "recurrent_expenses" WHERE ("recurrent_expenses"."id" = 1)
UPDATE "recurrent_expenses" SET "updated_at" = '2010-01-22 00:46:26', "months" = '---
---
  def update
    params[:recurrent_expense][:months] ||= []
    @recurrent_expense = RecurrentExpense.find(params[:id])
    @form_id = @recurrent_expense.id

    respond_to do |format|
      if @recurrent_expense.update_attributes(params[:recurrent_expense])