app/controllers/users_controller.rb

  def index
    @users = User.find(:all)
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def update
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def cancel
    if User.exists? params[:id]
      @user = User.find(params[:id])
---
SELECT "users".id FROM "users" WHERE ("users"."id" = '1') LIMIT 1